Revit 2024 API
ConceptualConstructionOpeningType Enumeration
 ConceptualConstructionType values for Openings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Since: 2012
Syntax
C#
public enum ConceptualConstructionOpeningType
Visual Basic
Public Enumeration ConceptualConstructionOpeningType
Visual C++
public enum class ConceptualConstructionOpeningType
Members
Member name | Description
InvalidOpeningTypeConstruction |  Invalid value/not set Opening Type Construction
Air |  Air Opening
NumOpeningTypeConstruction |  Total Number of Opening Type Constructions
See Also
Autodesk.Revit.DB.Analysis Namespace